## 🤖 Infrastructure Review Summary

⚠️ Gemini による要約生成に失敗しました


---

<details>
<summary>📋 Terraform Plan Details</summary>

```
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.ecs.data.aws_region.current: Reading...
module.ecs.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
data.aws_caller_identity.current: Read complete after 0s [id=222634370287]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_cloudwatch_log_group.app_logs will be created
  + resource "aws_cloudwatch_log_group" "app_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/ecs/myapp-dev/app"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Description" = "Application logs for ECS tasks"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-app-logs"
          + "Project"     = "myapp"
        }
      + tags_all          = {
          + "Description" = "Application logs for ECS tasks"
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-app-logs"
          + "Project"     = "myapp"
        }
    }

  # aws_db_subnet_group.main will be created
  + resource "aws_db_subnet_group" "main" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for myapp dev"
      + id                      = (known after apply)
      + name                    = "myapp-dev-db-subnet-group"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-db-subnet-group"
          + "Project"     = "myapp"
        }
      + tags_all                = {
          + "Environment" = "dev"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "myapp-dev-db-subnet-group"
          + "Project"     = "myapp"
        }
      + vpc_id                  = (known after apply)
    }

  # aws_ecr_lifecycle_policy.main will be created
  + resource "aws_ecr_lifecycle_policy" "main" {
      + id          = (known after apply)
      + policy      = jsonencode(
            {
              + rules = [
                  + {
                      + action       = {
                          + type = "expire"
                        }
                      + description  = "Keep last 10 images"
                      + rulePriority = 1
                      + selection    = {
                          + countNumber
```
</details>

<details>
<summary>💰 Infracost Details</summary>

```
2026-01-09T06:10:22Z INFO Autodetected 1 Terraform plan JSON file project across 1 root module
2026-01-09T06:10:22Z INFO Found Terraform plan JSON file project "tfplan.json" at directory "tfplan.json"
2026-01-09T06:10:23Z WARN 1 "aws_ecr_repository" price missing across 1 resource


Project: t-taketake/infra-spec-driven/terraform/aws/tfplan.json

 Name                                                         Monthly Qty  Unit              Monthly Cost   
                                                                                                            
 module.vpc.aws_nat_gateway.main[0]                                                                         
 ├─ NAT gateway                                                       730  hours                   $45.26   
 └─ Data processed                                         Monthly cost depends on usage: $0.062 per GB     
                                                                                                            
 module.rds.aws_db_instance.main                                                                            
 ├─ Database instance (on-demand, Single-AZ, db.t3.micro)             730  hours                   $20.44   
 ├─ Storage (general purpose SSD, gp3)                                 20  GB                       $2.76   
 └─ Additional backup storage                              Monthly cost depends on usage: $0.095 per GB     
                                                                                                            
 module.alb.aws_lb.main                                                                                     
 ├─ Application load balancer                                         730  hours                   $17.74   
 └─ Load balancer capacity units                           Monthly cost depends on usage: $5.84 per LCU     
                                                                                                            
 module.ecs.aws_ecs_service.main                                                                            
 ├─ Per GB per hour                                                   0.5  GB                       $2.02   
 └─ Per vCPU per hour                                                0.25  CPU                      $9.23   
                                                                                                            
 aws_cloudwatch_log_group.app_logs                                                                          
 ├─ Data ingested                                          Monthly cost depends on usage: $0.76 per GB      
 ├─ Archival Storage                                       Monthly cost depends on usage: $0.033 per GB     
 └─ Insights queries data scanned                          Monthly cost depends on usage: $0.0076 per GB    
                                                                                                            
 aws_ecr_repository.main                                                                                    
 └─ Storage                                                not found                                        
                                                                                                            
 module.ecs.aws_cloudwatch_log_group.ecs                                                                    
 ├─ Data ingested                                          Monthly cost depends on usage: $0.76 per GB      
 ├─ Archival Storage                                       Monthly cost depends on usage: $0.033 per GB     
 └─ Insights queries data scanned                          Monthly cost depends on usage: $0.0076 per GB    
                                                                                                            
 OVERALL TOTAL                                                                                    $97.44 

*Usage costs can be estimated by updating Infracost Cloud settings, see docs for other options.

──────────────────────────────────
52 cloud resources were detected:
∙ 7 were estimated
∙ 45 were free

┏━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━━━┳━━━━━━━━━━━━━┳━━━━━━━━━━━━┓
┃ Project                                                ┃ Baseline cost ┃ Usage cost* ┃ Total cost ┃
┣━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━━━╋━━━━━━━━━━━━━╋━━━━━━━━━━━━┫
┃ t-taketake/infra-spec-driven/terraform/aws/tfplan.json ┃           $97 ┃           - ┃        $97 ┃
┗━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━━━┻━━━━━━━━━━━━━┻━━━━━━━━━━━━┛

```
</details>

<details>
<summary>🔒 Security Scan Details</summary>

```

Report Summary

┌─────────────────────────────────────┬────────────────────────┬───────────────────┐
│               Target                │          Type          │ Misconfigurations │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ .                                   │ terraformplan-snapshot │         0         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ ../modules/aws/alb/main.tf          │ terraformplan-snapshot │         2         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ ../modules/aws/codebuild/main.tf    │       terraform        │         0         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ ../modules/aws/codepipeline/main.tf │       terraform        │         1         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ ../modules/aws/ecs/main.tf          │ terraformplan-snapshot │         0         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ ../modules/aws/rds/main.tf          │ terraformplan-snapshot │         2         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ ../modules/aws/security/main.tf     │ terraformplan-snapshot │         1         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ ../modules/aws/vpc/main.tf          │ terraformplan-snapshot │         3         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ acm                                 │       terraform        │         0         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ codebuild                           │       terraform        │         0         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ codepipeline                        │       terraform        │         0         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ main.tf                             │ terraformplan-snapshot │         0         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ rds                                 │       terraform        │         0         │
├─────────────────────────────────────┼────────────────────────┼───────────────────┤
│ route53                             │       terraform        │         0         │
└─────────────────────────────────────┴────────────────────────┴───────────────────┘
Legend:
- '-': Not scanned
- '0': Clean (no security findings detected)


../modules/aws/alb/main.tf (terraformplan-snapshot)
===================================================
Tests: 2 (SUCCESSES: 0, FAILURES: 2)
Failures: 2 (MEDIUM: 0, HIGH: 1, CRITICAL: 1)

AVD-AWS-0053 (HIGH): Load balancer is exposed publicly.
════════════════════════════════════════
There are many scenarios in which you would want to expose a load balancer to the wider internet, but this check exists as a warning to prevent accidental exposure of internal assets. You should ensure that this resource should be exposed publicly.


See https://avd.aquasec.com/misconfig/avd-aws-0053
────────────────────────────────────────
 ../modules/aws/alb/main.tf:24
   via ../modules/aws/alb/main.tf:21-38 (aws_lb.main)
    via main.tf:231-259 (module.alb)
────────────────────────────────────────
  21   resource "aws_lb" "main" {
  ..   
  24 [   internal           = false
  ..   
  38   }
────────────────────────────────────────


AVD-AWS-0054 (CRITICAL): Listener for application load balancer does not use HTTPS.
════════════════════════════════════════
Plain HTTP is unencrypted and human-readable. This means that if a malicious actor was to eavesdrop on your connection, they would be able to see all of your data flowing back and forth.
You should use HTTPS, which is HTTP over an encrypted (TLS) connection, meaning eavesdroppers cannot read your traffic.


See https://avd.aquasec.com/misconfig/avd-aws-0054
────────────────────────────────────────
 ../modules/aws/alb/main.tf:106-129
   via main.tf:231-259 (module.alb)
────────────────────────────────────────
 106 ┌ resource "aws_lb_listener" "http" {
 107 │   load_balancer_arn = aws_lb.main.arn
 108 │   port              = 80
 109 │   protocol          = "HTTP"
 110 │ 
 111 │   default_action {
 112 │     type = var.enable_https ? "redirect" : "forward"
 113 │ 
 114 └     dynamic "redirect" {
 ...   
────────────────────────────────────────



../modules/aws/codepipeline/main.tf (terraform)
===============================================
Tests: 1 (SUCCESSES: 0, FAILURES: 1)
Failures: 1 (MEDIUM: 0, HIGH: 1, CRITICAL: 0)

AVD-AWS-0132 (HIGH): Bucket does not encrypt data with a customer managed key.
════════════════════════════════════════
Encryption using AWS keys provides protection for your S3 buckets. To increase control of the encryption and manage factors like rotation use customer managed keys.


See https://avd.aquasec.com/misconfig/avd-aws-0132
────────────────────────────────────────
 ../modules/aws/codepipeline/main.tf:29-37
   via codepipeline/main.tf:38-56 (module.codepipeline)
────────────────────────────────────────
  29 ┌ resource "aws_s3_bucket_server_side_encryption_configuration" "artifacts" {
  30 │   bucket = aws_s3_bucket.artifacts.id
  31 │ 
  32 │   rule {
  33 │     apply_server_side_encryption_by_default {
  34 │       sse_algorithm = "AES256"
  35 │     }
  36 │   }
  37 └ }
────────────────────────────────────────



../modules/aws/rds/main.tf (terraformplan-snapshot)
===================================================
Tests: 2 (SUCCESSES: 0, FAILURES: 2)
Failures: 2 (MEDIUM: 2, HIGH: 0, CRITICAL: 0)

AVD-AWS-0176 (MEDIUM): Instance does not have IAM Authentication enabled
════════════════════════════════════════
Ensure IAM Database Authentication is enabled for RDS database instances to manage database access

See https://avd.aquasec.com/misconfig/avd-aws-0176
────────────────────────────────────────
 ../modules/aws/rds/main.tf:48-110
   via main.tf:312-344 (module.rds)
────────────────────────────────────────
  48 ┌ resource "aws_db_instance" "main" {
  49 │   identifier = "${var.project_name}-${var.environment}-rds-main"
  50 │ 
  51 │   # Engine
  52 │   engine               = "postgres"
  53 │   engine_version       = var.engine_version
  54 │   instance_class       = var.instance_class
  55 │   parameter_group_name = aws_db_parameter_group.main.name
  56 └ 
  ..   
────────────────────────────────────────


AVD-AWS-0177 (MEDIUM): Instance does not have Deletion Protection enabled
════════════════════════════════════════
Ensure deletion protection is enabled for RDS database instances.

See https://avd.aquasec.com/misconfig/avd-aws-0177
────────────────────────────────────────
 ../modules/aws/rds/main.tf:91
   via ../modules/aws/rds/main.tf:48-110 (aws_db_instance.main)
    via main.tf:312-344 (module.rds)
────────────────────────────────────────
  48   resource "aws_db_instance" "main" {
  ..   
  91 [   deletion_protection = var.deletion_protection
 ...   
 110   }
────────────────────────────────────────



../modules/aws/security/main.tf (terraformplan-snapshot)
========================================================
Tests: 1 (SUCCESSES: 0, FAILURES: 1)
Failures: 1 (MEDIUM: 0, HIGH: 0, CRITICAL: 1)

AVD-AWS-0104 (CRITICAL): Security group rule allows unrestricted egress to any IP address.
════════════════════════════════════════
Opening up ports to connect out to the public internet is generally to be avoided. You should restrict access to IP addresses or ranges that are explicitly required where possible.


See https://avd.aquasec.com/misconfig/aws-vpc-no-public-egress-sgr
────────────────────────────────────────
 ../modules/aws/security/main.tf:125
   via ../modules/aws/security/main.tf:118-130 (aws_vpc_security_group_egress_rule.ecs_https)
    via main.tf:138-150 (module.security)
────────────────────────────────────────
 118   resource "aws_vpc_security_group_egress_rule" "ecs_https" {
 ...   
 125 [   cidr_ipv4   = "0.0.0.0/0"
 ...   
 130   }
────────────────────────────────────────



../modules/aws/vpc/main.tf (terraformplan-snapshot)
===================================================
Tests: 3 (SUCCESSES: 0, FAILURES: 3)
Failures: 3 (MEDIUM: 1, HIGH: 2, CRITICAL: 0)

AVD-AWS-0164 (HIGH): Subnet associates public IP address.
════════════════════════════════════════
You should limit the provision of public IP addresses for resources. Resources should not be exposed on the public internet, but should have access limited to consumers required for the function of your application.


See https://avd.aquasec.com/misconfig/aws-vpc-no-public-ingress-sgr
────────────────────────────────────────
 ../modules/aws/vpc/main.tf:39
   via ../modules/aws/vpc/main.tf:33-46 (aws_subnet.public[0])
    via main.tf:90-103 (module.vpc)
────────────────────────────────────────
  33   resource "aws_subnet" "public" {
  ..   
  39 [   map_public_ip_on_launch = true
  ..   
  46   }
────────────────────────────────────────


AVD-AWS-0164 (HIGH): Subnet associates public IP address.
════════════════════════════════════════
You should limit the provision of public IP addresses for resources. Resources should not be exposed on the public internet, but should have access limited to consumers required for the function of your application.


See https://avd.aquasec.com/misconfig/aws-vpc-no-public-ingress-sgr
────────────────────────────────────────
 ../modules/aws/vpc/main.tf:39
   via ../modules/aws/vpc/main.tf:33-46 (aws_subnet.public[1])
    via main.tf:90-103 (module.vpc)
────────────────────────────────────────
  33   resource "aws_subnet" "public" {
  ..   
  39 [   map_public_ip_on_launch = true
  ..   
  46   }
────────────────────────────────────────


AVD-AWS-0178 (MEDIUM): VPC does not have VPC Flow Logs enabled.
════════════════════════════════════════
VPC Flow Logs provide visibility into network traffic that traverses the VPC and can be used to detect anomalous traffic or insight during security workflows.


See https://avd.aquasec.com/misconfig/aws-autoscaling-enable-at-rest-encryption
────────────────────────────────────────
 ../modules/aws/vpc/main.tf:13-21
   via main.tf:90-103 (module.vpc)
────────────────────────────────────────
  13 ┌ resource "aws_vpc" "main" {
  14 │   cidr_block           = var.vpc_cidr
  15 │   enable_dns_hostnames = true
  16 │   enable_dns_support   = true
  17 │ 
  18 │   tags = merge(var.tags, {
  19 │     Name = "${var.project_name}-${var.environment}-vpc"
  20 │   })
  21 └ }
────────────────────────────────────────



```
</details>

---
*このレビューは GitHub Actions + Gemini CLI によって自動生成されました*
